In [1]:
person = {
    "first": "Hammadoon",
    "last": "Issa",
    "email": "hammadoon.sss@gmail.com"
}

In [2]:
people = {
    "first": ["Hammadoon"],
    "last": ["Issa"],
    "email": ["hammadoon.sss@gmail.com"]
}

In [3]:
people_group = {
    "first": ["Hammadoon", "Ben", "Gon", "Jane","John" ],
    "last": ["Issa", "Ten", "Freecs", "Doe", "Doe"],
    "email": ["hammadoon.sss@gmail.com", "ben10@email.com", "gon.freecs@gmail.com", "janedoe@email.com", "johndoe@email.com"]
}

In [4]:
person

{'first': 'Hammadoon', 'last': 'Issa', 'email': 'hammadoon.sss@gmail.com'}

In [5]:
people

{'first': ['Hammadoon'],
 'last': ['Issa'],
 'email': ['hammadoon.sss@gmail.com']}

In [6]:
people_group

{'first': ['Hammadoon', 'Ben', 'Gon', 'Jane', 'John'],
 'last': ['Issa', 'Ten', 'Freecs', 'Doe', 'Doe'],
 'email': ['hammadoon.sss@gmail.com',
  'ben10@email.com',
  'gon.freecs@gmail.com',
  'janedoe@email.com',
  'johndoe@email.com']}

In [7]:
people_group['email']

['hammadoon.sss@gmail.com',
 'ben10@email.com',
 'gon.freecs@gmail.com',
 'janedoe@email.com',
 'johndoe@email.com']

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(people_group)

In [10]:
df

       first    last                    email
0  Hammadoon    Issa  hammadoon.sss@gmail.com
1        Ben     Ten          ben10@email.com
2        Gon  Freecs     gon.freecs@gmail.com
3       Jane     Doe        janedoe@email.com
4       John     Doe        johndoe@email.com

In [11]:
df['email']

0    hammadoon.sss@gmail.com
1            ben10@email.com
2       gon.freecs@gmail.com
3          janedoe@email.com
4          johndoe@email.com
Name: email, dtype: object

In [12]:
df[['last', 'email']]

     last                    email
0    Issa  hammadoon.sss@gmail.com
1     Ten          ben10@email.com
2  Freecs     gon.freecs@gmail.com
3     Doe        janedoe@email.com
4     Doe        johndoe@email.com

In [13]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [14]:
df.iloc[0]

first                  Hammadoon
last                        Issa
email    hammadoon.sss@gmail.com
Name: 0, dtype: object

In [15]:
df.iloc[[0,2]]

       first    last                    email
0  Hammadoon    Issa  hammadoon.sss@gmail.com
2        Gon  Freecs     gon.freecs@gmail.com

In [16]:
df.iloc[[0,1], 2]

0    hammadoon.sss@gmail.com
1            ben10@email.com
Name: email, dtype: object

In [17]:
df

       first    last                    email
0  Hammadoon    Issa  hammadoon.sss@gmail.com
1        Ben     Ten          ben10@email.com
2        Gon  Freecs     gon.freecs@gmail.com
3       Jane     Doe        janedoe@email.com
4       John     Doe        johndoe@email.com

In [18]:
df.loc[0]

first                  Hammadoon
last                        Issa
email    hammadoon.sss@gmail.com
Name: 0, dtype: object

In [19]:
df.loc[[0,1]]

       first  last                    email
0  Hammadoon  Issa  hammadoon.sss@gmail.com
1        Ben   Ten          ben10@email.com

In [20]:
df.loc[[0,1], 'email']

0    hammadoon.sss@gmail.com
1            ben10@email.com
Name: email, dtype: object

In [21]:
df.loc[[0,2], ['email', 'last']]

                     email    last
0  hammadoon.sss@gmail.com    Issa
2     gon.freecs@gmail.com  Freecs

In [22]:
df

       first    last                    email
0  Hammadoon    Issa  hammadoon.sss@gmail.com
1        Ben     Ten          ben10@email.com
2        Gon  Freecs     gon.freecs@gmail.com
3       Jane     Doe        janedoe@email.com
4       John     Doe        johndoe@email.com

In [23]:
df.set_index('email')

                             first    last
email
hammadoon.sss@gmail.com  Hammadoon    Issa
ben10@email.com                Ben     Ten
gon.freecs@gmail.com           Gon  Freecs
janedoe@email.com             Jane     Doe
johndoe@email.com             John     Doe

In [24]:
df

       first    last                    email
0  Hammadoon    Issa  hammadoon.sss@gmail.com
1        Ben     Ten          ben10@email.com
2        Gon  Freecs     gon.freecs@gmail.com
3       Jane     Doe        janedoe@email.com
4       John     Doe        johndoe@email.com

In [25]:
#  Set index to particular label(column)
df.set_index('email', inplace=True)
df

                             first    last
email
hammadoon.sss@gmail.com  Hammadoon    Issa
ben10@email.com                Ben     Ten
gon.freecs@gmail.com           Gon  Freecs
janedoe@email.com             Jane     Doe
johndoe@email.com             John     Doe

In [26]:
df.index

Index(['hammadoon.sss@gmail.com', 'ben10@email.com', 'gon.freecs@gmail.com',
       'janedoe@email.com', 'johndoe@email.com'],
      dtype='object', name='email')

In [27]:
df.loc['hammadoon.sss@gmail.com']

first    Hammadoon
last          Issa
Name: hammadoon.sss@gmail.com, dtype: object

In [28]:
df.loc['hammadoon.sss@gmail.com', 'last']

'Issa'

In [29]:
# df.loc[0]
# it is not working because the index has changed to email
df.iloc[0]
# it still work

first    Hammadoon
last          Issa
Name: hammadoon.sss@gmail.com, dtype: object

In [30]:
# Reset index to original Value
df.reset_index(inplace=True)
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4        johndoe@email.com       John     Doe

In [31]:
# filter dataframe 
filt = (df['last'] == 'Doe')

In [32]:
# .loc is used to get column with specific filter 
# first value is/are the row(s) we want && second value is/are the column(s) we want
df.loc[filt, 'email']

3    janedoe@email.com
4    johndoe@email.com
Name: email, dtype: object

In [33]:
# Filter based on AND(&) operator
filt2 = (df['last'] =='Doe') & (df['first'] == 'John')

In [34]:
df.loc[filt2, 'email']

4    johndoe@email.com
Name: email, dtype: object

In [35]:
# Filter based on OR(|) operator
filt3 = (df['last'] =='Issa') | (df['first'] == 'Gon')

In [36]:
df.loc[filt3, 'email']

0    hammadoon.sss@gmail.com
2       gon.freecs@gmail.com
Name: email, dtype: object

In [37]:
# NOT of above OR operator: opposite
df.loc[~filt3, 'email']

1      ben10@email.com
3    janedoe@email.com
4    johndoe@email.com
Name: email, dtype: object

In [38]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [39]:
# change names of all columns in dataframe
df.columns = ['email', 'first_name', 'last_name']
df

                     email first_name last_name
0  hammadoon.sss@gmail.com  Hammadoon      Issa
1          ben10@email.com        Ben       Ten
2     gon.freecs@gmail.com        Gon    Freecs
3        janedoe@email.com       Jane       Doe
4        johndoe@email.com       John       Doe

In [40]:
# make all columns' letter UPPERCASE
df.columns = [x.upper() for x in df.columns]
df

                     EMAIL FIRST_NAME LAST_NAME
0  hammadoon.sss@gmail.com  Hammadoon      Issa
1          ben10@email.com        Ben       Ten
2     gon.freecs@gmail.com        Gon    Freecs
3        janedoe@email.com       Jane       Doe
4        johndoe@email.com       John       Doe

In [41]:
# replace ' '(space) with '_'(underscore)
df.columns = df.columns.str.replace(' ', '_')
df

                     EMAIL FIRST_NAME LAST_NAME
0  hammadoon.sss@gmail.com  Hammadoon      Issa
1          ben10@email.com        Ben       Ten
2     gon.freecs@gmail.com        Gon    Freecs
3        janedoe@email.com       Jane       Doe
4        johndoe@email.com       John       Doe

In [42]:
# make all columns' letter lowercase
df.columns = [x.lower() for x in df.columns]
df

                     email first_name last_name
0  hammadoon.sss@gmail.com  Hammadoon      Issa
1          ben10@email.com        Ben       Ten
2     gon.freecs@gmail.com        Gon    Freecs
3        janedoe@email.com       Jane       Doe
4        johndoe@email.com       John       Doe

In [43]:
# Renaming  specific columns' name 
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4        johndoe@email.com       John     Doe

In [44]:
# When we want to change whole row 
df.loc[4] = ['JohnSmith@gmail.com', 'John', 'Smith']
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4      JohnSmith@gmail.com       John   Smith

In [45]:
# when we want to change multiple row
df.loc[4, ['last', 'email']] = ['Doe', 'johndoe@gmail.com']
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4        johndoe@gmail.com       John     Doe

In [46]:
# when we want to change single column/row data
df.loc[4, 'last'] = 'Smith'
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4        johndoe@gmail.com       John   Smith

In [47]:
# filt = (df['email'] == 'johndoe@gmail.com')
# df[filt]
# df[filt]['last'] ='Son'

# ERROR:
# home/hammadoon/Desktop/Python/Python_DS/venv/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning: 
# A value is trying to be set on a copy of a slice from a DataFrame.
# Try using .loc[row_indexer,col_indexer] = value instead

# See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
#   This is separate from the ipykernel package so we can avoid doing imports until

In [48]:
filt = (df['email'] == 'johndoe@gmail.com')
df.loc[filt, 'last'] ='Son'
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4        johndoe@gmail.com       John     Son

In [49]:
df['email'] = df['email'].str.lower()
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4        johndoe@gmail.com       John     Son

In [50]:
df['email'].apply(len)

0    23
1    15
2    20
3    17
4    17
Name: email, dtype: int64

In [51]:
def update_email(email):
    return email.upper()

In [52]:
df['email'].apply(update_email)

0    HAMMADOON.SSS@GMAIL.COM
1            BEN10@EMAIL.COM
2       GON.FREECS@GMAIL.COM
3          JANEDOE@EMAIL.COM
4          JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [53]:
 df['email'] =  df['email'].apply(update_email)

In [54]:
df

                     email      first    last
0  HAMMADOON.SSS@GMAIL.COM  Hammadoon    Issa
1          BEN10@EMAIL.COM        Ben     Ten
2     GON.FREECS@GMAIL.COM        Gon  Freecs
3        JANEDOE@EMAIL.COM       Jane     Doe
4        JOHNDOE@GMAIL.COM       John     Son

In [55]:
df['email'] =  df['email'].apply( lambda x : x.lower())

In [56]:
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4        johndoe@gmail.com       John     Son

In [57]:
df.apply(len)

email    5
first    5
last     5
dtype: int64

In [58]:
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [59]:
df.apply(pd.Series.min)

email    ben10@email.com
first                Ben
last                 Doe
dtype: object

In [60]:
df.apply(lambda x: x.min())

email    ben10@email.com
first                Ben
last                 Doe
dtype: object

In [61]:
df.applymap(len)

   email  first  last
0     23      9     4
1     15      3     3
2     20      3     6
3     17      4     3
4     17      4     3

In [62]:
df.applymap(str.lower)

                     email      first    last
0  hammadoon.sss@gmail.com  hammadoon    issa
1          ben10@email.com        ben     ten
2     gon.freecs@gmail.com        gon  freecs
3        janedoe@email.com       jane     doe
4        johndoe@gmail.com       john     son

In [63]:
df['first'].map({'Hammadoon': 'Hammad', 'Ben': 'Kevin', 'Gon': 'Killua'})

0    Hammad
1     Kevin
2    Killua
3       NaN
4       NaN
Name: first, dtype: object

In [64]:
df['first'].replace({'Hammadoon': 'Hammad', 'Ben': 'Kevin', 'Gon': 'Killua'})

0    Hammad
1     Kevin
2    Killua
3      Jane
4      John
Name: first, dtype: object

In [65]:
df

                     email      first    last
0  hammadoon.sss@gmail.com  Hammadoon    Issa
1          ben10@email.com        Ben     Ten
2     gon.freecs@gmail.com        Gon  Freecs
3        janedoe@email.com       Jane     Doe
4        johndoe@gmail.com       John     Son

In [66]:
df['first'] + ' ' + df['last']

0    Hammadoon Issa
1           Ben Ten
2        Gon Freecs
3          Jane Doe
4          John Son
dtype: object

In [69]:
# adding 'full_name' column in df by concat 'first' & 'last' columns
df['full_name'] = df['first'] + ' ' + df['last']
df

                     email      first    last       full_name
0  hammadoon.sss@gmail.com  Hammadoon    Issa  Hammadoon Issa
1          ben10@email.com        Ben     Ten         Ben Ten
2     gon.freecs@gmail.com        Gon  Freecs      Gon Freecs
3        janedoe@email.com       Jane     Doe        Jane Doe
4        johndoe@gmail.com       John     Son        John Son

In [75]:
# Drop multiple columns  
df.drop(columns =  ['first', 'last'], inplace=True)
# KeyError: "['first' 'last'] not found in axis"
# Error: Due to Rerunning the above Code 
# because the specified columns is already Drop

KeyError: "['first' 'last'] not found in axis"

In [74]:
df

                     email       full_name
0  hammadoon.sss@gmail.com  Hammadoon Issa
1          ben10@email.com         Ben Ten
2     gon.freecs@gmail.com      Gon Freecs
3        janedoe@email.com        Jane Doe
4        johndoe@gmail.com        John Son

In [76]:
df['full_name'].str.split(' ')

0    [Hammadoon, Issa]
1           [Ben, Ten]
2        [Gon, Freecs]
3          [Jane, Doe]
4          [John, Son]
Name: full_name, dtype: object

In [77]:
df['full_name'].str.split(' ', expand=True)

           0       1
0  Hammadoon    Issa
1        Ben     Ten
2        Gon  Freecs
3       Jane     Doe
4       John     Son

In [79]:
# Spliting 'full_name' column and adding them into 2 new columns respectively.
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [80]:
df

                     email       full_name      first    last
0  hammadoon.sss@gmail.com  Hammadoon Issa  Hammadoon    Issa
1          ben10@email.com         Ben Ten        Ben     Ten
2     gon.freecs@gmail.com      Gon Freecs        Gon  Freecs
3        janedoe@email.com        Jane Doe       Jane     Doe
4        johndoe@gmail.com        John Son       John     Son

In [81]:
df.append({'first': 'Tony'})
# Error: 
# TypeError: Can only append a dict if ignore_index=True

TypeError: Can only append a dict if ignore_index=True

In [82]:
df.append({'first': 'Tony'}, ignore_index=True)

                     email       full_name      first    last
0  hammadoon.sss@gmail.com  Hammadoon Issa  Hammadoon    Issa
1          ben10@email.com         Ben Ten        Ben     Ten
2     gon.freecs@gmail.com      Gon Freecs        Gon  Freecs
3        janedoe@email.com        Jane Doe       Jane     Doe
4        johndoe@gmail.com        John Son       John     Son
5                      NaN             NaN       Tony     NaN

In [83]:
people_group = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers",],
    "email": ["ironman_3000@avenge.com", "cap@avenge.com"]
}
df2 = pd.DataFrame(people_group)

In [84]:
df2

   first    last                    email
0   Tony   Stark  ironman_3000@avenge.com
1  Steve  Rogers           cap@avenge.com

In [85]:
df.append(df2, ignore_index=True)

                     email       full_name      first    last
0  hammadoon.sss@gmail.com  Hammadoon Issa  Hammadoon    Issa
1          ben10@email.com         Ben Ten        Ben     Ten
2     gon.freecs@gmail.com      Gon Freecs        Gon  Freecs
3        janedoe@email.com        Jane Doe       Jane     Doe
4        johndoe@gmail.com        John Son       John     Son
5  ironman_3000@avenge.com             NaN       Tony   Stark
6           cap@avenge.com             NaN      Steve  Rogers

In [86]:
df

                     email       full_name      first    last
0  hammadoon.sss@gmail.com  Hammadoon Issa  Hammadoon    Issa
1          ben10@email.com         Ben Ten        Ben     Ten
2     gon.freecs@gmail.com      Gon Freecs        Gon  Freecs
3        janedoe@email.com        Jane Doe       Jane     Doe
4        johndoe@gmail.com        John Son       John     Son

In [87]:
df = df.append(df2, ignore_index=True)

In [88]:
df

                     email       full_name      first    last
0  hammadoon.sss@gmail.com  Hammadoon Issa  Hammadoon    Issa
1          ben10@email.com         Ben Ten        Ben     Ten
2     gon.freecs@gmail.com      Gon Freecs        Gon  Freecs
3        janedoe@email.com        Jane Doe       Jane     Doe
4        johndoe@gmail.com        John Son       John     Son
5  ironman_3000@avenge.com             NaN       Tony   Stark
6           cap@avenge.com             NaN      Steve  Rogers